src/Documents/инкШтатноеРасписание/инкШтатноеРасписание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>инкШтатноеРасписание</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.инкОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.инкПодразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентНадбавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентРайонныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСевернаяНадбавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтатноеРасписание</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.инкПодразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.инкДолжности</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоШтатныхЕдиниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТарифнаяСтавкаОклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РайонныйКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СевернаяНадбавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Надбавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/инкШтатноеРасписание/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначениямиПоУмолчанию();
	РассчитатьТабличнуюЧастьШтатноеРасписание();
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ТекстВопроса = НСтр("ru = 'Заполнить данными табличную часть штатного расписания?'");
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентРайонныйКоэффициентПриИзменении(Элемент)
	РассчитатьТабличнуюЧастьШтатноеРасписание("РК"); 
КонецПроцедуры

&НаКлиенте
Процедура ПроцентСевернаяНадбавкаПриИзменении(Элемент)
	РассчитатьТабличнуюЧастьШтатноеРасписание("СН");
КонецПроцедуры

&НаКлиенте
Процедура ПроцентНадбавкаПриИзменении(Элемент)
	РассчитатьТабличнуюЧастьШтатноеРасписание("Н");
КонецПроцедуры

&НаКлиенте
Процедура ШтатноеРасписаниеПриИзменении(Элемент)
	РассчитатьТабличнуюЧастьШтатноеРасписание();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РассчитатьТабличнуюЧастьШтатноеРасписание(ПолеРасчета = "")
	
	Для каждого ШтатноеРасписаниеСтрока Из Объект.ШтатноеРасписание Цикл
		
		Если ПолеРасчета = "РК" Тогда
			ШтатноеРасписаниеСтрока.РайонныйКоэффициент = ШтатноеРасписаниеСтрока.ТарифнаяСтавкаОклад 
			                                            * Объект.ПроцентРайонныйКоэффициент / 100;
		ИначеЕсли ПолеРасчета = "СН" Тогда												
			ШтатноеРасписаниеСтрока.СевернаяНадбавка    = ШтатноеРасписаниеСтрока.ТарифнаяСтавкаОклад 
			                                            * Объект.ПроцентСевернаяНадбавка / 100;
		ИначеЕсли ПолеРасчета = "Н" Тогда												
			ШтатноеРасписаниеСтрока.Надбавка			= ШтатноеРасписаниеСтрока.ТарифнаяСтавкаОклад
			                                            * Объект.ПроцентНадбавка / 100;
		КонецЕсли;
		
		ШтатноеРасписаниеСтрока.Всего = ШтатноеРасписаниеСтрока.КоличествоШтатныхЕдиниц
		                              *
		                              ( ШтатноеРасписаниеСтрока.ТарифнаяСтавкаОклад
		                              + ШтатноеРасписаниеСтрока.РайонныйКоэффициент
									  + ШтатноеРасписаниеСтрока.СевернаяНадбавка
									  + ШтатноеРасписаниеСтрока.Надбавка
		                              );
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначениямиПоУмолчанию()

	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Справочники.инкОрганизации.ПолучитьЕдинственнуюОрганизацию();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодС) Тогда
		Объект.ПериодС = НачалоГода(ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(Знач Результат, Знач ДопПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьНаСервере();   
		
	КонецЕсли;
	
КонецПроцедуры               

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ПервичноеЗаполнениеШтатноеРасписание();
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	РассчитатьТабличнуюЧастьШтатноеРасписание();
	
КонецПроцедуры

#Область о // Печать:

&НаКлиенте
Процедура ШтатноеРасписание(Команда)

	ТабличныйДокумент = ПолучитьШтатноеРасписание(); 
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;   
	ТабличныйДокумент.АвтоМасштаб = Истина;        
	ТабличныйДокумент.ПолеСлева = 10;
	ТабличныйДокумент.ПолеСправа = 10;
	инкОтчетыКлиент.ПечатьТабличногоДокумента(ТабличныйДокумент,"Штатное расписание",ЭтаФорма);

КонецПроцедуры

&НаСервере
Функция ПолучитьШтатноеРасписание()
		
	МенеджерПечати = РеквизитФормыВЗначение("Объект");
	ТабличныйДокумент = МенеджерПечати.СформироватьШтатноеРасписание();
	
	Возврат ТабличныйДокумент; 
	
КонецФункции

#КонецОбласти

#КонецОбласти
